# Access Controls.Json


{
  "implemented-requirements": [
    {
      "uuid": "e1b74de7-8c0a-4e0c-8c44-18c6e4c8b6b9",
      "control-id": "IAC-01.3",
      "description": "The MinIO service maintains an automated inventory of authorized users and service accounts through its IAM system, which regularly synchronizes with external identity providers and internal user databases to ensure an up-to-date list of all active users and service accounts."
    },
    {
      "uuid": "f300d3c2-1e8d-4339-8b5c-7a9a0e6c7b5d",
      "control-id": "IAC-02",
      "description": "MinIO employs a robust Identity and Access Management (IAM) system that uniquely identifies users through access and secret keys, ensuring that all organizational users are authenticated, authorized, and audited before accessing sensitive data."
    },
    {
      "uuid": "a0e45cd7-3bc3-4b7e-bb58-2a6c740a5c9d",
      "control-id": "IAC-02.2",
      "description": "The service utilizes JSON Web Tokens (JWT) for authentication, which are time-bound and signed, providing replay-resistant authentication mechanisms to prevent unauthorized access."
    },
    {
      "uuid": "7c6d3e4e-8c1e-4e2d-8e4d-cd4f1b783e2c",
      "control-id": "IAC-03",
      "description": "MinIO's IAM system supports third-party user identification and access control through integration with external identity providers, ensuring that third-party users are authenticated, authorized, and logged appropriately."
    },
    {
      "uuid": "c3b77d24-0e58-44d2-8cd7-3f0d4c9e6f0e",
      "control-id": "IAC-04",
      "description": "The service implements bidirectional authentication mechanisms that uniquely identify and authenticate devices connecting to MinIO, ensuring secure communication through cryptographic methods."
    },
    {
      "uuid": "d4b6c5b4-f3b3-4c75-8f99-9a5f1c9e5e6d",
      "control-id": "IAC-04.1",
      "description": "MinIO ensures accurate device identification and authentication by centrally managing the joining of systems to the domain through its IAM policies, which validate devices during the initial asset configuration process."
    },
    {
      "uuid": "d3eebc2f-1c63-4f5d-8cdd-9a1f9e4e2179",
      "control-id": "IAC-06",
      "description": "The service enforces Multi-Factor Authentication (MFA) for sensitive access scenarios, such as remote network access and critical operations, by requiring additional authentication factors beyond just passwords."
    },
    {
      "uuid": "b5a50c85-8c83-4b7b-9e5d-8f9e4b5d5f7a",
      "control-id": "IAC-08",
      "description": "MinIO implements Role-Based Access Control (RBAC) by creating policies that define permissions based on user roles, ensuring that access to sensitive data is granted based on need-to-know principles."
    },
    {
      "uuid": "f2b7e1e4-5c4d-4ae7-bc2a-27b6c5f5e5f5",
      "control-id": "IAC-13.1",
      "description": "The service provides Single Sign-On (SSO) capabilities through integration with identity providers, allowing users to authenticate once and gain access to multiple systems without needing to re-enter credentials."
    },
    {
      "uuid": "a3c76b1a-e0c3-4941-9e1f-e5f0e5d5e6a2",
      "control-id": "IAC-16",
      "description": "MinIO restricts privileged access rights through its IAM policies, which ensure that only authorized users can perform actions that require elevated permissions, thereby controlling access effectively."
    },
    {
      "uuid": "e8d5f9a8-6c1d-4d0e-8e9f-9a5e1c3c4e4e",
      "control-id": "IAC-20",
      "description": "The service enforces Logical Access Control (LAC) permissions using IAM policies, which are designed to conform to the principle of least privilege, ensuring users can only access resources necessary for their role."
    },
    {
      "uuid": "d9c4b2d8-9c3e-4f55-9b6a-4e7f0c4f5e6e",
      "control-id": "IAC-21",
      "description": "MinIO implements the concept of least privilege through its IAM policies, allowing only authorized access to processes necessary for users to fulfill their job functions in accordance with organizational business functions."
    },
    {
      "uuid": "f4b5c7d6-3c1f-4d7e-8c5b-0f1e3c4e5f5f",
      "control-id": "IAC-21.3",
      "description": "The service restricts privileged account assignments to authorized personnel only, managed through IAM policies that enforce approval for any assignment of privileged roles."
    },
    {
      "uuid": "b2c6f0f3-2d8f-4c6e-9d9e-bc5e9f8e5c5d",
      "control-id": "IAC-22",
      "description": "MinIO enforces a limit on consecutive invalid login attempts by locking user accounts after a defined threshold is reached, thereby enhancing security against brute-force attacks."
    },
    {
      "uuid": "c3e6b8d5-2d4e-4b9e-9c7f-7e9b4e5e6b4e",
      "control-id": "IAC-23",
      "description": "The service limits the number of concurrent sessions for each user account through IAM settings, ensuring resource allocation is managed effectively and preventing session hijacking."
    },
    {
      "uuid": "a6b8e1c4-4e9f-46db-8e6f-2f1c7a5c7e5e",
      "control-id": "IAC-29",
      "description": "MinIO employs Attribute-Based Access Control (ABAC) by utilizing user attributes in its IAM policies, allowing for dynamic authorizations that support the secure sharing of information."
    }
  ]
}
