# Access Controls.Json


{
  "implemented-requirements": [
    {
      "uuid": "d1f5b428-8646-4f1f-9d8b-2e2c8b6a7f47",
      "control-id": "IAC-01.3",
      "description": "The system maintains an automated inventory of authorized users and service accounts by querying the user management database (e.g., LDAP) on a scheduled basis, ensuring that any additions or removals of accounts are reflected in real-time to maintain compliance."
    },
    {
      "uuid": "a2b3c4d5-e6f7-8901-abcdef23ghij",
      "control-id": "IAC-02",
      "description": "The software implements a centralized authentication mechanism using JWT tokens, which uniquely identifies users and provides an audit trail of user actions through logging of all authentication attempts."
    },
    {
      "uuid": "f3e4d5c6-b7a8-9a0b-abcdef12ghij",
      "control-id": "IAC-02.2",
      "description": "The system employs a nonce-based approach for replay-resistant authentication by generating unique session tokens that are validated against a database of active sessions, ensuring the integrity of each authentication attempt."
    },
    {
      "uuid": "b7f8a9b1-c2d3-4f5e-a6b7-8c9d0e1f2a3b",
      "control-id": "IAC-03",
      "description": "Third-party users are authenticated through OAuth 2.0, which maintains a centralized record of third-party access tokens and logs all authorization attempts to ensure compliance with access control policies."
    },
    {
      "uuid": "c3a4b5d6-e7f8-90a1-b2c3-d4e5f6g7h8i9",
      "control-id": "IAC-04",
      "description": "Bidirectional authentication for devices is managed through X.509 certificates, which must be validated against a central Certificate Authority (CA) before allowing any device to establish a connection."
    },
    {
      "uuid": "d4e5f6g7-h8i9-0a1b-c2d3-e4f5g6h7i8j9",
      "control-id": "IAC-04.1",
      "description": "The system implements a device attestation process that leverages device certificates validated against a corporate CA during the initial configuration phase, ensuring that only trusted devices join the network."
    },
    {
      "uuid": "e5f6g7h8-i9j0-1a2b-c3d4-e5f6g7h8i9j0",
      "control-id": "IAC-06",
      "description": "Multi-Factor Authentication (MFA) is enforced for all remote network access by requiring users to provide a second factor, such as a one-time code sent via SMS or an authenticator app, in addition to their password."
    },
    {
      "uuid": "f6g7h8i9-j0k1-2a3b-c4d5-e6f7g8h9i0j1",
      "control-id": "IAC-08",
      "description": "Role-Based Access Control (RBAC) is implemented using a policy engine that evaluates user roles and enforces access permissions dynamically based on the principle of least privilege across all resources."
    },
    {
      "uuid": "g7h8i9j0-k1l2-3a4b-c5d6-e7f8g9h0i1j2",
      "control-id": "IAC-13.1",
      "description": "Single Sign-On (SSO) capabilities are provided through a centralized identity provider, allowing users to authenticate once and gain access to multiple systems without repeated logins."
    },
    {
      "uuid": "h8i9j0k1-l2m3-4a5b-c6d7-e8f9g0h1i2j3",
      "control-id": "IAC-16",
      "description": "Privileged Account Management (PAM) is enforced by utilizing a vault solution that controls access to sensitive credentials and requires approval workflows for any access to privileged accounts."
    },
    {
      "uuid": "i9j0k1l2-m3n4-5a6b-c7d8-e9f0g1h2i3j4",
      "control-id": "IAC-20",
      "description": "Logical Access Control (LAC) permissions are enforced through a centralized policy management system that ensures access is granted strictly based on user roles and responsibilities."
    },
    {
      "uuid": "j0k1l2m3-n4o5-6a7b-c8d9-e0f1g2h3i4j5",
      "control-id": "IAC-21",
      "description": "The concept of least privilege is applied by ensuring that user roles are defined with the minimum necessary permissions, and access reviews are conducted regularly to adjust permissions as needed."
    },
    {
      "uuid": "k1l2m3n4-o5p6-7a8b-c9d0-e1f2g3h4i5j6",
      "control-id": "IAC-21.3",
      "description": "Privileged accounts are restricted to management-approved roles only, with a formal approval process in place for any assignments or modifications to privileged account access."
    },
    {
      "uuid": "l2m3n4o5-p6q7-8a9b-c0d1-e2f3g4h5i6j7",
      "control-id": "IAC-22",
      "description": "The system enforces an account lockout policy that limits consecutive invalid login attempts to five within a 15-minute window, automatically locking the account if exceeded."
    },
    {
      "uuid": "m3n4o5p6-q7r8-9a0b-c1d2-e3f4g5h6i7j8",
      "control-id": "IAC-23",
      "description": "Concurrent session control is maintained by limiting users to three active sessions at any given time, with real-time monitoring of session counts enforced by the authentication server."
    },
    {
      "uuid": "n4o5p6q7-r8s9-0a1b-c2d3-e4f5g6h7i8j9",
      "control-id": "IAC-29",
      "description": "Attribute-Based Access Control (ABAC) is implemented using policies that evaluate user attributes dynamically at access request time, facilitating granular and context-aware access control."
    }
  ]
}
